[
  {
    "Description": "Before any data is collected or models are built, it's crucial to define the problem space. This stage shapes the project's direction and impact. Early ethical, legal, and societal reflections help ensure that the goals are clear, legitimate, and sensitive to the needs and rights of all stakeholders.",
    "FormFile": "forms/reflections/reflection_phase1.json",
    "PhaseID": 1
  },
  {
    "Description": "Gathering data introduces immediate ethical and legal responsibilities. Decisions about what data to collect, from whom, and how, can embed biases or privacy risks into the project from the start. This stage focuses on ensuring data is responsibly sourced and appropriate for the intended purpose.",
    "FormFile": "forms/reflections/reflection_phase2.json",
    "PhaseID": 2
  },
  {
    "Description": "Preparing data for modelling involves many invisible choices that can have ethical consequences. Handling missing data, filtering, and normalizing can inadvertently introduce bias or exclude important perspectives. Careful reflection at this stage helps maintain data integrity and fairness.",
    "FormFile": "forms/reflections/reflection_phase3.json",
    "PhaseID": 3
  },
  {
    "Description": "Model building is where technical innovation meets real-world impact. Decisions about features, training data, model types, and trade-offs directly affect fairness, transparency, and safety. Embedding ELSA thinking here helps align the technical system with broader human and societal values.",
    "FormFile": "forms/reflections/reflection_phase4.json",
    "PhaseID": 4
  },
  {
    "Description": "Testing a model's performance must go beyond standard accuracy metrics. It’s essential to evaluate how well the model performs across different groups and whether it behaves consistently with ethical and legal expectations. Critical evaluation ensures models are not only effective but also just and trustworthy.",
    "FormFile": "forms/reflections/reflection_phase5.json",
    "PhaseID": 5
  },
  {
    "Description": "Deploying a system in the real world brings new challenges: user interaction, societal impact, and regulatory compliance. Ethical deployment involves ensuring transparency, accountability, and safeguards for those affected by the system’s outcomes.",
    "FormFile": "forms/reflections/reflection_phase6.json",
    "PhaseID": 6
  },
  {
    "Description": "Once deployed, systems continue to affect people and environments—and they can drift, degrade, or produce unforeseen effects. Ethical monitoring ensures that problems are detected early and that the system remains aligned with its intended ethical and legal commitments over time.",
    "FormFile": "forms/reflections/reflection_phase7.json",
    "PhaseID": 7
  },
  {
    "Description": "Good documentation makes ethical and legal decision-making visible, understandable, and accountable. Communicating clearly about risks, limitations, and choices builds trust with users, stakeholders, and regulators, and ensures the system can be responsibly maintained and improved.",
    "FormFile": "forms/reflections/reflection_phase8.json",
    "PhaseID": 8
  }
]
